04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p0_refined_kOmegaSST_OF7/0/R
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(3.74752e-09 2.71461e-11 -5.65453e-34 3.74749e-09 2.34027e-36 3.74751e-09)
(3.90746e-09 2.87003e-11 -1.2896e-33 3.90743e-09 9.43462e-34 3.90745e-09)
(4.08732e-09 3.05415e-11 -1.08117e-33 4.0873e-09 5.81433e-33 4.08731e-09)
(4.27116e-09 3.23256e-11 -7.6045e-34 4.27114e-09 3.50054e-32 4.27115e-09)
(4.46529e-09 3.42427e-11 -4.75142e-34 4.46528e-09 -6.48548e-32 4.46528e-09)
(4.6672e-09 3.61542e-11 -3.1527e-34 4.6672e-09 -2.66559e-32 4.66719e-09)
(4.87377e-09 3.80709e-11 1.8365e-34 4.87377e-09 -4.89724e-32 4.87377e-09)
(5.08877e-09 4.00179e-11 -5.61653e-35 5.08879e-09 9.6351e-32 5.08877e-09)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 0 0 6.66667e-16 0 6.66667e-16);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 0 0 6.66667e-16 0 6.66667e-16);
    }
}


// ************************************************************************* //
